{"config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "batch_input_shape": [null, 9, 9, 12], "name": "conv2d_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_3", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_4", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 1000, "name": "dense_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 2, "name": "dense_2", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}