{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 9, 9, 12], "padding": "valid", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 1000}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "units": 2}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}