{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"activity_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 9, 9, 12], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_2", "filters": 64, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_3", "filters": 64, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_4", "filters": 64, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_1", "trainable": true, "units": 1000, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_2", "trainable": true, "units": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}