{"config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 9, 9, 12], "filters": 64, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_3", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "units": 1000, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "units": 2, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}