{"config": {"layers": [{"config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "strides": [1, 1], "batch_input_shape": [null, 9, 9, 12], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 1000, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"units": 2, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}