{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 9, 9, 12], "name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 1000, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}