{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "batch_input_shape": [null, 9, 9, 12], "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "valid", "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "name": "conv2d_4", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "units": 1000, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "units": 2, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "name": "dense_2"}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}