{"config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 9, 9, 12], "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "dtype": "float32", "padding": "valid", "activation": "relu", "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_2", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_3", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_4", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 1000, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 2, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}